class Answers:
    HOW_MUCH = "Сутки — 400 рублей. Оплата курьеру — наличными или картой."
    WANT_MANI_SCOOTER = "Пока что у нас так: один заказ — один самокат. Если хотите покататься с друзьями, можете просто сделать несколько заказов — один за другим."
    HOW_CHECK_TIME_RENT = "Допустим, вы оформляете заказ на 8 мая. Мы привозим самокат 8 мая в течение дня. Отсчёт времени аренды начинается с момента, когда вы оплатите заказ курьеру. Если мы привезли самокат 8 мая в 20:30, суточная аренда закончится 9 мая в 20:30."
    CAN_BE_ORDERED_TODAY = (
        "Только начиная с завтрашнего дня. Но скоро станем расторопнее."
    )
    EXTEND_THE_ORDER = "Пока что нет! Но если что-то срочное — всегда можно позвонить в поддержку по красивому номеру 1010."
    BRING_CHARGERS = "Самокат приезжает к вам с полной зарядкой. Этого хватает на восемь суток — даже если будете кататься без передышек и во сне. Зарядка не понадобится."
    CANCEL_THE_ORDER = "Да, пока самокат не привезли. Штрафа не будет, объяснительной записки тоже не попросим. Все же свои."
    LIVE_OUTSIDE_THE_MOSCOW_RING = (
        "Да, обязательно. Всем самокатов! И Москве, и Московской области."
    )


class Url:
    HOST = "https://qa-scooter.praktikum-services.ru/"
    DZEN_SITE = "https://dzen.ru/?yredirect=true"
